In [1]:
import pandas as pd
import numpy as np
from sklearn import tree 
from sklearn import preprocessing

# Reading the Data

In [2]:
titanic_train = pd.read_csv('train.csv')
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Converting the Data

In [3]:
titanic_train['Age'].mean()

32.69985376827896

In [4]:
new_age = np.where(titanic_train['Age'].isnull(),32,titanic_train['Age'])

In [5]:
titanic_train['Age'] = new_age

In [6]:
label_encoder = preprocessing.LabelEncoder()

In [7]:
encoded_sex = label_encoder.fit_transform(titanic_train['Sex'])

In [8]:
titanic_train['Sex'] = encoded_sex
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [9]:
tree_model = tree.DecisionTreeClassifier()

# Decision Tree Model

In [10]:
predictors = pd.DataFrame([encoded_sex, titanic_train['Age'], titanic_train['Fare']]).T

In [11]:
predictors.head()

     0     1        2
0  1.0  22.0   7.2500
1  0.0  38.0  71.2833
2  0.0  26.0   7.9250
3  0.0  35.0  53.1000
4  1.0  35.0   8.0500

In [12]:
tree_model.fit(X = predictors, y = titanic_train['Survived'])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [13]:
with open("DTreeTitanic.dot","w") as f:
    f = tree.export_graphviz(tree_model, feature_names=['Sex','Age','Fare'],out_file=f)

In [14]:
tree_model.score(X = predictors, y = titanic_train['Survived'])

0.9763779527559056

The model is __97.64 %__ accurate

# Prediction

In [16]:
titanic_test = pd.read_csv('test.csv')
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

This data doesn't have the Survived column, so we will predict the values of the Survived column

In [17]:
titanic_test['Age'].mean()

33.23741007194245

In [18]:
new_age_test = np.where(titanic_test['Age'].isnull(),33,titanic_test['Age'])

In [19]:
titanic_test['Age'] = new_age_test

In [20]:
encoded_sex_test = label_encoder.fit_transform(titanic_test['Sex'])

In [22]:
titanic_test['Sex'] = encoded_sex_test
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,S

In [26]:
test_features = pd.DataFrame([encoded_sex_test, titanic_test['Age'], titanic_test['Fare']]).T

In [27]:
test_features.head()

     0     1        2
0  1.0  34.5   7.8292
1  0.0  47.0   7.0000
2  1.0  62.0   9.6875
3  1.0  27.0   8.6625
4  0.0  22.0  12.2875

In [28]:
test_prediction = tree_model.predict(X = test_features)

In [29]:
predicted_op = pd.DataFrame({"PassengerId":titanic_test['PassengerId'], "Survived":test_prediction})

In [31]:
predicted_op.to_csv("Output.csv",index=False)